apache/nuttx/arch/risc-v/src/hpm6000/hardware/hpm6300/hpm6300_sysctl.h
/****************************************************************************
 * arch/risc-v/src/hpm6000/hardware/hpm6300/hpm6300_sysctl.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_RISCV_SRC_HPM6000_HARDWARE_HPM6300_HPM6300_SYSCTL_H
#define __ARCH_RISCV_SRC_HPM6000_HARDWARE_HPM6300_HPM6300_SYSCTL_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "hpm6300_memorymap.h"

#define HPM_SYSCTL_RESOURCE_CPU0                    (HPM_SYSCTL_BASE + 0x0000)
#define HPM_SYSCTL_RESOURCE_CPX0                    (HPM_SYSCTL_BASE + 0x0004)
#define HPM_SYSCTL_RESOURCE_POW_CPU0                (HPM_SYSCTL_BASE + 0x0054)
#define HPM_SYSCTL_RESOURCE_RST_SOC                 (HPM_SYSCTL_BASE + 0x0058)
#define HPM_SYSCTL_RESOURCE_RST_CPU0                (HPM_SYSCTL_BASE + 0x005c)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_XTAL            (HPM_SYSCTL_BASE + 0x0080)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_PLL0            (HPM_SYSCTL_BASE + 0x0084)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL0       (HPM_SYSCTL_BASE + 0x0088)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL0       (HPM_SYSCTL_BASE + 0x008c)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_CLK2_PLL0       (HPM_SYSCTL_BASE + 0x0090)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_PLL1            (HPM_SYSCTL_BASE + 0x0094)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL1       (HPM_SYSCTL_BASE + 0x0098)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL1       (HPM_SYSCTL_BASE + 0x009c)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_PLL2            (HPM_SYSCTL_BASE + 0x00a0)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_CLK0_PLL2       (HPM_SYSCTL_BASE + 0x00a4)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_CLK1_PLL2       (HPM_SYSCTL_BASE + 0x00a8)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_PLL0_REF        (HPM_SYSCTL_BASE + 0x00ac)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_PLL1_REF        (HPM_SYSCTL_BASE + 0x00b0)
#define HPM_SYSCTL_RESOURCE_CLK_SRC_PLL2_REF        (HPM_SYSCTL_BASE + 0x00b4)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_CPU0            (HPM_SYSCTL_BASE + 0x0100)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_MCT0            (HPM_SYSCTL_BASE + 0x0104)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_FEMC            (HPM_SYSCTL_BASE + 0x0108)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_XPI0            (HPM_SYSCTL_BASE + 0x010c)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_XPI1            (HPM_SYSCTL_BASE + 0x0110)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_TMR0            (HPM_SYSCTL_BASE + 0x0114)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_TMR1            (HPM_SYSCTL_BASE + 0x0118)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_TMR2            (HPM_SYSCTL_BASE + 0x011c)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_TMR3            (HPM_SYSCTL_BASE + 0x0120)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_UART0           (HPM_SYSCTL_BASE + 0x0124)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_UART1           (HPM_SYSCTL_BASE + 0x0128)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_UART2           (HPM_SYSCTL_BASE + 0x012c)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_UART3           (HPM_SYSCTL_BASE + 0x0130)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_UART4           (HPM_SYSCTL_BASE + 0x0134)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_UART5           (HPM_SYSCTL_BASE + 0x0138)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_UART6           (HPM_SYSCTL_BASE + 0x013c)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_UART7           (HPM_SYSCTL_BASE + 0x0140)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_I2C0            (HPM_SYSCTL_BASE + 0x0144)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_IC21            (HPM_SYSCTL_BASE + 0x0148)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_IC22            (HPM_SYSCTL_BASE + 0x014c)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_IC23            (HPM_SYSCTL_BASE + 0x0150)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_SPI0            (HPM_SYSCTL_BASE + 0x0154)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_SPI1            (HPM_SYSCTL_BASE + 0x0158)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_SPI2            (HPM_SYSCTL_BASE + 0x015c)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_SPI3            (HPM_SYSCTL_BASE + 0x0160)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_CAN0            (HPM_SYSCTL_BASE + 0x0164)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_CAN1            (HPM_SYSCTL_BASE + 0x0168)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_PTPC            (HPM_SYSCTL_BASE + 0x016c)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_ANA0            (HPM_SYSCTL_BASE + 0x0170)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_ANA1            (HPM_SYSCTL_BASE + 0x0174)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_ANA2            (HPM_SYSCTL_BASE + 0x0178)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_ANA3            (HPM_SYSCTL_BASE + 0x017c)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_AUD0            (HPM_SYSCTL_BASE + 0x0180)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_AUD1            (HPM_SYSCTL_BASE + 0x0184)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_ETH0            (HPM_SYSCTL_BASE + 0x0188)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_PTP0            (HPM_SYSCTL_BASE + 0x018c)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_REF0            (HPM_SYSCTL_BASE + 0x0190)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_REF1            (HPM_SYSCTL_BASE + 0x0194)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_NTM0            (HPM_SYSCTL_BASE + 0x0198)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_SDC0            (HPM_SYSCTL_BASE + 0x019c)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_ADC0            (HPM_SYSCTL_BASE + 0x0200)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_ADC1            (HPM_SYSCTL_BASE + 0x0204)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_ADC2            (HPM_SYSCTL_BASE + 0x0208)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_DAC0            (HPM_SYSCTL_BASE + 0x020c)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_I2S0            (HPM_SYSCTL_BASE + 0x0210)
#define HPM_SYSCTL_RESOURCE_CLK_TOP_I2S1            (HPM_SYSCTL_BASE + 0x0214)
#define HPM_SYSCTL_RESOURCE_AHBP                    (HPM_SYSCTL_BASE + 0x0400)
#define HPM_SYSCTL_RESOURCE_AXIS                    (HPM_SYSCTL_BASE + 0x0404)
#define HPM_SYSCTL_RESOURCE_AXIC                    (HPM_SYSCTL_BASE + 0x0408)
#define HPM_SYSCTL_RESOURCE_FEMC                    (HPM_SYSCTL_BASE + 0x040c)
#define HPM_SYSCTL_RESOURCE_ROM0                    (HPM_SYSCTL_BASE + 0x0410)
#define HPM_SYSCTL_RESOURCE_LMM0                    (HPM_SYSCTL_BASE + 0x0414)
#define HPM_SYSCTL_RESOURCE_RAM0                    (HPM_SYSCTL_BASE + 0x0418)
#define HPM_SYSCTL_RESOURCE_MCT0                    (HPM_SYSCTL_BASE + 0x041c)
#define HPM_SYSCTL_RESOURCE_XPI0                    (HPM_SYSCTL_BASE + 0x0420)
#define HPM_SYSCTL_RESOURCE_XPI1                    (HPM_SYSCTL_BASE + 0x0424)
#define HPM_SYSCTL_RESOURCE_SDP0                    (HPM_SYSCTL_BASE + 0x0428)
#define HPM_SYSCTL_RESOURCE_RNG0                    (HPM_SYSCTL_BASE + 0x042c)
#define HPM_SYSCTL_RESOURCE_KMAN                    (HPM_SYSCTL_BASE + 0x0430)
#define HPM_SYSCTL_RESOURCE_DMA0                    (HPM_SYSCTL_BASE + 0x0434)
#define HPM_SYSCTL_RESOURCE_DMA1                    (HPM_SYSCTL_BASE + 0x0438)
#define HPM_SYSCTL_RESOURCE_FFA0                    (HPM_SYSCTL_BASE + 0x043c)
#define HPM_SYSCTL_RESOURCE_GPIO                    (HPM_SYSCTL_BASE + 0x0440)
#define HPM_SYSCTL_RESOURCE_MBX0                    (HPM_SYSCTL_BASE + 0x0444)
#define HPM_SYSCTL_RESOURCE_WDG0                    (HPM_SYSCTL_BASE + 0x0448)
#define HPM_SYSCTL_RESOURCE_WDG1                    (HPM_SYSCTL_BASE + 0x044c)
#define HPM_SYSCTL_RESOURCE_TSNS                    (HPM_SYSCTL_BASE + 0x0450)
#define HPM_SYSCTL_RESOURCE_TMR0                    (HPM_SYSCTL_BASE + 0x0454)
#define HPM_SYSCTL_RESOURCE_TMR1                    (HPM_SYSCTL_BASE + 0x0458)
#define HPM_SYSCTL_RESOURCE_RMR2                    (HPM_SYSCTL_BASE + 0x045c)
#define HPM_SYSCTL_RESOURCE_TMR3                    (HPM_SYSCTL_BASE + 0x0460)
#define HPM_SYSCTL_RESOURCE_URT0                    (HPM_SYSCTL_BASE + 0x0464)
#define HPM_SYSCTL_RESOURCE_URT1                    (HPM_SYSCTL_BASE + 0x0468)
#define HPM_SYSCTL_RESOURCE_URT2                    (HPM_SYSCTL_BASE + 0x046c)
#define HPM_SYSCTL_RESOURCE_URT3                    (HPM_SYSCTL_BASE + 0x0470)
#define HPM_SYSCTL_RESOURCE_URT4                    (HPM_SYSCTL_BASE + 0x0474)
#define HPM_SYSCTL_RESOURCE_URT5                    (HPM_SYSCTL_BASE + 0x0478)
#define HPM_SYSCTL_RESOURCE_URT6                    (HPM_SYSCTL_BASE + 0x047c)
#define HPM_SYSCTL_RESOURCE_URT7                    (HPM_SYSCTL_BASE + 0x0480)
#define HPM_SYSCTL_RESOURCE_I2C0                    (HPM_SYSCTL_BASE + 0x0484)
#define HPM_SYSCTL_RESOURCE_I2C1                    (HPM_SYSCTL_BASE + 0x0488)
#define HPM_SYSCTL_RESOURCE_I2C2                    (HPM_SYSCTL_BASE + 0x048c)
#define HPM_SYSCTL_RESOURCE_I2C3                    (HPM_SYSCTL_BASE + 0x0490)
#define HPM_SYSCTL_RESOURCE_SPI0                    (HPM_SYSCTL_BASE + 0x0494)
#define HPM_SYSCTL_RESOURCE_SPI1                    (HPM_SYSCTL_BASE + 0x0498)
#define HPM_SYSCTL_RESOURCE_SPI2                    (HPM_SYSCTL_BASE + 0x049c)
#define HPM_SYSCTL_RESOURCE_SPI3                    (HPM_SYSCTL_BASE + 0x04a0)
#define HPM_SYSCTL_RESOURCE_CAN0                    (HPM_SYSCTL_BASE + 0x04a4)
#define HPM_SYSCTL_RESOURCE_CAN1                    (HPM_SYSCTL_BASE + 0x04a8)
#define HPM_SYSCTL_RESOURCE_PTPC                    (HPM_SYSCTL_BASE + 0x04ac)
#define HPM_SYSCTL_RESOURCE_ADC0                    (HPM_SYSCTL_BASE + 0x04b0)
#define HPM_SYSCTL_RESOURCE_ADC1                    (HPM_SYSCTL_BASE + 0x04b4)
#define HPM_SYSCTL_RESOURCE_ADC2                    (HPM_SYSCTL_BASE + 0x04b8)
#define HPM_SYSCTL_RESOURCE_DAC0                    (HPM_SYSCTL_BASE + 0x04bc)
#define HPM_SYSCTL_RESOURCE_ACMP                    (HPM_SYSCTL_BASE + 0x04c0)
#define HPM_SYSCTL_RESOURCE_I2S0                    (HPM_SYSCTL_BASE + 0x04c4)
#define HPM_SYSCTL_RESOURCE_I2S1                    (HPM_SYSCTL_BASE + 0x04c8)
#define HPM_SYSCTL_RESOURCE_PDM0                    (HPM_SYSCTL_BASE + 0x04cc)
#define HPM_SYSCTL_RESOURCE_DAO                     (HPM_SYSCTL_BASE + 0x04d0)
#define HPM_SYSCTL_RESOURCE_MSYN                    (HPM_SYSCTL_BASE + 0x04d4)
#define HPM_SYSCTL_RESOURCE_MOT0                    (HPM_SYSCTL_BASE + 0x04d8)
#define HPM_SYSCTL_RESOURCE_MOT1                    (HPM_SYSCTL_BASE + 0x04dc)
#define HPM_SYSCTL_RESOURCE_ETH0                    (HPM_SYSCTL_BASE + 0x04e0)
#define HPM_SYSCTL_RESOURCE_NTM0                    (HPM_SYSCTL_BASE + 0x04e4)
#define HPM_SYSCTL_RESOURCE_SDC0                    (HPM_SYSCTL_BASE + 0x04e8)
#define HPM_SYSCTL_RESOURCE_USB0                    (HPM_SYSCTL_BASE + 0x04ec)
#define HPM_SYSCTL_RESOURCE_REF0                    (HPM_SYSCTL_BASE + 0x04f0)
#define HPM_SYSCTL_RESOURCE_REF1                    (HPM_SYSCTL_BASE + 0x04f4)
#define HPM_SYSCTL_GROUP0_LINK0_VALUE               (HPM_SYSCTL_BASE + 0x0800)
#define HPM_SYSCTL_GROUP0_LINK0_SET                 (HPM_SYSCTL_BASE + 0x0804)
#define HPM_SYSCTL_GROUP0_LINK0_CLEAR               (HPM_SYSCTL_BASE + 0x0808)
#define HPM_SYSCTL_GROUP0_LINK0_TOGGLE              (HPM_SYSCTL_BASE + 0x080c)
#define HPM_SYSCTL_GROUP0_LINK1_VALUE               (HPM_SYSCTL_BASE + 0x0810)
#define HPM_SYSCTL_GROUP0_LINK1_SET                 (HPM_SYSCTL_BASE + 0x0814)
#define HPM_SYSCTL_GROUP0_LINK1_CLEAR               (HPM_SYSCTL_BASE + 0x0818)
#define HPM_SYSCTL_GROUP0_LINK1_TOGGLE              (HPM_SYSCTL_BASE + 0x081c)
#define HPM_SYSCTL_AFFILIATE_CPU0_VALUE             (HPM_SYSCTL_BASE + 0x0900)
#define HPM_SYSCTL_AFFILIATE_CPU0_SET               (HPM_SYSCTL_BASE + 0x0904)
#define HPM_SYSCTL_AFFILIATE_CPU0_CLEAR             (HPM_SYSCTL_BASE + 0x0908)
#define HPM_SYSCTL_AFFILIATE_CPU0_TOGGLE            (HPM_SYSCTL_BASE + 0x090c)
#define HPM_SYSCTL_RETENTION_CPU0_VALUE             (HPM_SYSCTL_BASE + 0x0920)
#define HPM_SYSCTL_RETENTION_CPU0_SET               (HPM_SYSCTL_BASE + 0x0924)
#define HPM_SYSCTL_RETENTION_CPU0_CLEAR             (HPM_SYSCTL_BASE + 0x0928)
#define HPM_SYSCTL_RETENTION_CPU0_TOGGLE            (HPM_SYSCTL_BASE + 0x092c)
#define HPM_SYSCTL_POWER_CPU0_STATUS                (HPM_SYSCTL_BASE + 0x1000)
#define HPM_SYSCTL_POWER_CPU0_LF_WAIT               (HPM_SYSCTL_BASE + 0x1004)
#define HPM_SYSCTL_POWER_CPU0_OFF_WAIT              (HPM_SYSCTL_BASE + 0x100c)
#define HPM_SYSCTL_RESET_SOC_CONTROL                (HPM_SYSCTL_BASE + 0x1400)
#define HPM_SYSCTL_RESET_SOC_CONFIG                 (HPM_SYSCTL_BASE + 0x1404)
#define HPM_SYSCTL_RESET_SOC_COUNTER                (HPM_SYSCTL_BASE + 0x140c)
#define HPM_SYSCTL_RESET_CPU0_CONTROL               (HPM_SYSCTL_BASE + 0x1410)
#define HPM_SYSCTL_RESET_CPU0_CONFIG                (HPM_SYSCTL_BASE + 0x1414)
#define HPM_SYSCTL_RESET_CPU0_COUNTER               (HPM_SYSCTL_BASE + 0x141c)
#define HPM_SYSCTL_CLOCK_CPU_CLK_TOP_CPU0           (HPM_SYSCTL_BASE + 0x1800)
#define HPM_SYSCTL_CLOCK_CLK_TOP_MCT0               (HPM_SYSCTL_BASE + 0x1804)
#define HPM_SYSCTL_CLOCK_CLK_TOP_FEMC               (HPM_SYSCTL_BASE + 0x1808)
#define HPM_SYSCTL_CLOCK_CLK_TOP_XPI0               (HPM_SYSCTL_BASE + 0x180c)
#define HPM_SYSCTL_CLOCK_CLK_TOP_XPI1               (HPM_SYSCTL_BASE + 0x1810)
#define HPM_SYSCTL_CLOCK_CLK_TOP_TMR0               (HPM_SYSCTL_BASE + 0x1814)
#define HPM_SYSCTL_CLOCK_CLK_TOP_TMR1               (HPM_SYSCTL_BASE + 0x1818)
#define HPM_SYSCTL_CLOCK_CLK_TOP_TMR2               (HPM_SYSCTL_BASE + 0x181c)
#define HPM_SYSCTL_CLOCK_CLK_TOP_TMR3               (HPM_SYSCTL_BASE + 0x1820)
#define HPM_SYSCTL_CLOCK_CLK_TOP_UART0              (HPM_SYSCTL_BASE + 0x1824)
#define HPM_SYSCTL_CLOCK_CLK_TOP_UART1              (HPM_SYSCTL_BASE + 0x1828)
#define HPM_SYSCTL_CLOCK_CLK_TOP_UART2              (HPM_SYSCTL_BASE + 0x182c)
#define HPM_SYSCTL_CLOCK_CLK_TOP_UART3              (HPM_SYSCTL_BASE + 0x1830)
#define HPM_SYSCTL_CLOCK_CLK_TOP_UART4              (HPM_SYSCTL_BASE + 0x1834)
#define HPM_SYSCTL_CLOCK_CLK_TOP_UART5              (HPM_SYSCTL_BASE + 0x1838)
#define HPM_SYSCTL_CLOCK_CLK_TOP_UART6              (HPM_SYSCTL_BASE + 0x183c)
#define HPM_SYSCTL_CLOCK_CLK_TOP_UART7              (HPM_SYSCTL_BASE + 0x1840)
#define HPM_SYSCTL_CLOCK_CLK_TOP_I2C0               (HPM_SYSCTL_BASE + 0x1844)
#define HPM_SYSCTL_CLOCK_CLK_TOP_IC21               (HPM_SYSCTL_BASE + 0x1848)
#define HPM_SYSCTL_CLOCK_CLK_TOP_IC22               (HPM_SYSCTL_BASE + 0x184c)
#define HPM_SYSCTL_CLOCK_CLK_TOP_IC23               (HPM_SYSCTL_BASE + 0x1850)
#define HPM_SYSCTL_CLOCK_CLK_TOP_SPI0               (HPM_SYSCTL_BASE + 0x1854)
#define HPM_SYSCTL_CLOCK_CLK_TOP_SPI1               (HPM_SYSCTL_BASE + 0x1858)
#define HPM_SYSCTL_CLOCK_CLK_TOP_SPI2               (HPM_SYSCTL_BASE + 0x185c)
#define HPM_SYSCTL_CLOCK_CLK_TOP_SPI3               (HPM_SYSCTL_BASE + 0x1860)
#define HPM_SYSCTL_CLOCK_CLK_TOP_CAN0               (HPM_SYSCTL_BASE + 0x1864)
#define HPM_SYSCTL_CLOCK_CLK_TOP_CAN1               (HPM_SYSCTL_BASE + 0x1868)
#define HPM_SYSCTL_CLOCK_CLK_TOP_PTPC               (HPM_SYSCTL_BASE + 0x186c)
#define HPM_SYSCTL_CLOCK_CLK_TOP_ANA0               (HPM_SYSCTL_BASE + 0x1870)
#define HPM_SYSCTL_CLOCK_CLK_TOP_ANA1               (HPM_SYSCTL_BASE + 0x1874)
#define HPM_SYSCTL_CLOCK_CLK_TOP_ANA2               (HPM_SYSCTL_BASE + 0x1878)
#define HPM_SYSCTL_CLOCK_CLK_TOP_ANA3               (HPM_SYSCTL_BASE + 0x187c)
#define HPM_SYSCTL_CLOCK_CLK_TOP_AUD0               (HPM_SYSCTL_BASE + 0x1880)
#define HPM_SYSCTL_CLOCK_CLK_TOP_AUD1               (HPM_SYSCTL_BASE + 0x1884)
#define HPM_SYSCTL_CLOCK_CLK_TOP_ETH0               (HPM_SYSCTL_BASE + 0x1888)
#define HPM_SYSCTL_CLOCK_CLK_TOP_PTP0               (HPM_SYSCTL_BASE + 0x188c)
#define HPM_SYSCTL_CLOCK_CLK_TOP_REF0               (HPM_SYSCTL_BASE + 0x1890)
#define HPM_SYSCTL_CLOCK_CLK_TOP_REF1               (HPM_SYSCTL_BASE + 0x1894)
#define HPM_SYSCTL_CLOCK_CLK_TOP_NTM0               (HPM_SYSCTL_BASE + 0x1898)
#define HPM_SYSCTL_CLOCK_CLK_TOP_SDC0               (HPM_SYSCTL_BASE + 0x189c)
#define HPM_SYSCTL_ADCCLK_CLK_TOP_ADC0              (HPM_SYSCTL_BASE + 0x1c00)
#define HPM_SYSCTL_ADCCLK_CLK_TOP_ADC1              (HPM_SYSCTL_BASE + 0x1c04)
#define HPM_SYSCTL_ADCCLK_CLK_TOP_ADC2              (HPM_SYSCTL_BASE + 0x1c08)
#define HPM_SYSCTL_ADCCLK_CLK_TOP_DAC0              (HPM_SYSCTL_BASE + 0x1c0c)
#define HPM_SYSCTL_I2SCLK_CLK_TOP_I2S0              (HPM_SYSCTL_BASE + 0x1c10)
#define HPM_SYSCTL_I2SCLK_CLK_TOP_I2S1              (HPM_SYSCTL_BASE + 0x1c14)
#define HPM_SYSCTL_GLOBAL00                         (HPM_SYSCTL_BASE + 0x2000)
#define HPM_SYSCTL_MONITOR_SLICE0_CONTROL           (HPM_SYSCTL_BASE + 0x2400)
#define HPM_SYSCTL_MONITOR_SLICE0_CURRENT           (HPM_SYSCTL_BASE + 0x2404)
#define HPM_SYSCTL_MONITOR_SLICE0_LOW_LIMIT         (HPM_SYSCTL_BASE + 0x2408)
#define HPM_SYSCTL_MONITOR_SLICE0_HIGH_LIMIT        (HPM_SYSCTL_BASE + 0x240c)
#define HPM_SYSCTL_MONITOR_SLICE1_CONTROL           (HPM_SYSCTL_BASE + 0x2420)
#define HPM_SYSCTL_MONITOR_SLICE1_CURRENT           (HPM_SYSCTL_BASE + 0x2424)
#define HPM_SYSCTL_MONITOR_SLICE1_LOW_LIMIT         (HPM_SYSCTL_BASE + 0x2428)
#define HPM_SYSCTL_MONITOR_SLICE1_HIGH_LIMIT        (HPM_SYSCTL_BASE + 0x242c)
#define HPM_SYSCTL_MONITOR_SLICE2_CONTROL           (HPM_SYSCTL_BASE + 0x2440)
#define HPM_SYSCTL_MONITOR_SLICE2_CURRENT           (HPM_SYSCTL_BASE + 0x2444)
#define HPM_SYSCTL_MONITOR_SLICE2_LOW_LIMIT         (HPM_SYSCTL_BASE + 0x2448)
#define HPM_SYSCTL_MONITOR_SLICE2_HIGH_LIMIT        (HPM_SYSCTL_BASE + 0x244c)
#define HPM_SYSCTL_MONITOR_SLICE3_CONTROL           (HPM_SYSCTL_BASE + 0x2460)
#define HPM_SYSCTL_MONITOR_SLICE3_CURRENT           (HPM_SYSCTL_BASE + 0x2464)
#define HPM_SYSCTL_MONITOR_SLICE3_LOW_LIMIT         (HPM_SYSCTL_BASE + 0x2468)
#define HPM_SYSCTL_MONITOR_SLICE3_HIGH_LIMIT        (HPM_SYSCTL_BASE + 0x246c)
#define HPM_SYSCTL_CPU_CPU0_LP                      (HPM_SYSCTL_BASE + 0x2800)
#define HPM_SYSCTL_CPU_CPU0_LOCK                    (HPM_SYSCTL_BASE + 0x2804)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR0                (HPM_SYSCTL_BASE + 0x2808)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR1                (HPM_SYSCTL_BASE + 0x280c)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR2                (HPM_SYSCTL_BASE + 0x2810)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR3                (HPM_SYSCTL_BASE + 0x2814)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR4                (HPM_SYSCTL_BASE + 0x2818)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR5                (HPM_SYSCTL_BASE + 0x281c)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR6                (HPM_SYSCTL_BASE + 0x2820)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR7                (HPM_SYSCTL_BASE + 0x2824)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR8                (HPM_SYSCTL_BASE + 0x2828)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR9                (HPM_SYSCTL_BASE + 0x282c)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR10               (HPM_SYSCTL_BASE + 0x2830)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR11               (HPM_SYSCTL_BASE + 0x2834)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR12               (HPM_SYSCTL_BASE + 0x2838)
#define HPM_SYSCTL_CPU_CPU0_GPR_GPR13               (HPM_SYSCTL_BASE + 0x283c)
#define HPM_SYSCTL_CPU_CPU0_WAKEUP_STATUS_STATUS0   (HPM_SYSCTL_BASE + 0x2840)
#define HPM_SYSCTL_CPU_CPU0_WAKEUP_STATUS_STATUS1   (HPM_SYSCTL_BASE + 0x2844)
#define HPM_SYSCTL_CPU_CPU0_WAKEUP_STATUS_STATUS2   (HPM_SYSCTL_BASE + 0x2848)
#define HPM_SYSCTL_CPU_CPU0_WAKEUP_STATUS_STATUS3   (HPM_SYSCTL_BASE + 0x284c)
#define HPM_SYSCTL_CPU_CPU0_WAKEUP_ENABLE_ENABLE0   (HPM_SYSCTL_BASE + 0x2880)
#define HPM_SYSCTL_CPU_CPU0_WAKEUP_ENABLE_ENABLE1   (HPM_SYSCTL_BASE + 0x2884)
#define HPM_SYSCTL_CPU_CPU0_WAKEUP_ENABLE_ENABLE2   (HPM_SYSCTL_BASE + 0x2888)
#define HPM_SYSCTL_CPU_CPU0_WAKEUP_ENABLE_ENABLE3   (HPM_SYSCTL_BASE + 0x288c)

