apache/nuttx/arch/risc-v/src/hpm6000/hardware/hpm6300/hpm6300_sysctl.h
#define SYSCTL_RESOURCE_GLB_BUSY                  (1 << 31)
#define SYSCTL_RESOURCE_LOC_BUSY                  (1 << 30)
#define SYSCTL_RESOURCE_MODE_SHIFT                (0U)
#define SYSCTL_RESOURCE_MODE_MASK                 (0x3U << SYSCTL_RESOURCE_MODE_SHIFT)
#  define SYSCTL_RESOURCE_MODE_AUTO               (0 << SYSCTL_RESOURCE_MODE_SHIFT)
#  define SYSCTL_RESOURCE_MODE_ON                 (1 << SYSCTL_RESOURCE_MODE_SHIFT)
#  define SYSCTL_RESOURCE_MODE_OFF                (2 << SYSCTL_RESOURCE_MODE_SHIFT)
#  define SYSCTL_RESOURCE_MODE_RESV               (3 << SYSCTL_RESOURCE_MODE_SHIFT)

#define SYSCTL_GROUP0(n)                          (1U << (n))

#define SYSCTL_AFFILIATE(n)                       (1U << (n))

#define SYSCTL_RETENTION_LINK_SHIFT               (0)
#define SYSCTL_RETENTION_LINK_MASK                (0xffU << SYSCTL_RETENTION_LINK_SHIFT)
#  define SYSCTL_RETENTION_LINK_SOC_RAM           (0 << SYSCTL_RETENTION_LINK_SHIFT)
#  define SYSCTL_RETENTION_LINK_PERIPH_REG        (1 << SYSCTL_RETENTION_LINK_SHIFT)
#  define SYSCTL_RETENTION_LINK_CPU0_RAM          (2 << SYSCTL_RETENTION_LINK_SHIFT) 
#  define SYSCTL_RETENTION_LINK_CPU0_REG          (3 << SYSCTL_RETENTION_LINK_SHIFT)
#  define SYSCTL_RETENTION_LINK_XTAL              (4 << SYSCTL_RETENTION_LINK_SHIFT)
#  define SYSCTL_RETENTION_LINK_PLL0              (5 << SYSCTL_RETENTION_LINK_SHIFT)
#  define SYSCTL_RETENTION_LINK_PLL1              (6 << SYSCTL_RETENTION_LINK_SHIFT)
#  define SYSCTL_RETENTION_LINK_PLL2              (7 << SYSCTL_RETENTION_LINK_SHIFT)

#define SYSCTL_POWER_STATUS_FLAG                  (1 << 31)
#define SYSCTL_POWER_STATUS_FLAG_WAKE             (1 << 30)
#define SYSCTL_POWER_LF_DISABLE                   (1 << 12)
#define SYSCTL_POWER_LF_ACK                       (1 << 8)

#define SYSCTL_POWER_LF_WAIT_WAIT_SHIFT           (0)
#define SYSCTL_POWER_LF_WAIT_WAIT_MASK            (0xfffffU << SYSCTL_POWER_LF_WAIT_WAIT_SHIFT)
#define SYSCTL_POWER_LF_WAIT_WAIT(n)              ((n) << SYSCTL_POWER_LF_WAIT_WAIT_SHIFT)

#define SYSCTL_POWER_OFF_WAIT_WAIT_SHIFT          (0)
#define SYSCTL_POWER_OFF_WAIT_WAIT_MASK           (0xfffffU << SYSCTL_POWER_OFF_WAIT_WAIT_SHIFT)
#define SYSCTL_POWER_OFF_WAIT_WAIT(n)             ((n) << SYSCTL_POWER_OFF_WAIT_WAIT_SHIFT)

#define SYSCTL_RESET_CONTROL_FLAG                 (1 << 31)
#define SYSCTL_RESET_CONTROL_FLAG_WAKE            (1 << 30)
#define SYSCTL_RESET_CONTROL_HOLD                 (1 << 4)
#define SYSCTL_RESET_CONTROL_RESET                (1 << 0)

#define SYSCTL_RESET_CONFIG_PRE_WAIT_SHIFT        (16)
#define SYSCTL_RESET_CONFIG_PRE_WAIT_MASK         (0xffU << SYSCTL_RESET_CONFIG_PRE_WAIT_SHIFT)
#define SYSCTL_RESET_CONFIG_PRE_WAIT(n)           ((n) << SYSCTL_RESET_CONFIG_PRE_WAIT_SHIFT)
#define SYSCTL_RESET_CONFIG_RSTCLK_NUM_SHIFT      (8)
#define SYSCTL_RESET_CONFIG_RSTCLK_NUM_MASK       (0xffU << SYSCTL_RESET_CONFIG_RSTCLK_NUM_SHIFT)
#define SYSCTL_RESET_CONFIG_RSTCLK_NUM(n)         ((n) << SYSCTL_RESET_CONFIG_RSTCLK_NUM_SHIFT)
#define SYSCTL_RESET_CONFIG_POST_WAIT_SHIFT       (0)
#define SYSCTL_RESET_CONFIG_POST_WAIT_MASK        (0xffU << SYSCTL_RESET_CONFIG_POST_WAIT_SHIFT)
#define SYSCTL_RESET_CONFIG_POST_WAIT(n)          ((n) << SYSCTL_RESET_CONFIG_POST_WAIT_SHIFT)

#define SYSCTL_RESET_COUNTER_COUNTER_SHIFT        (0)
#define SYSCTL_RESET_COUNTER_COUNTER_MASK         (0xfffffU << SYSCTL_RESET_COUNTER_COUNTER_SHIFT)
#define SYSCTL_RESET_COUNTER_COUNTER(n)           ((n) << SYSCTL_RESET_COUNTER_COUNTER_SHIFT)

#define SYSCTL_CLOCK_CPU_GLB_BUSY                 (1 << 31)
#define SYSCTL_CLOCK_CPU_LOC_BUSY                 (1 << 30)
#define SYSCTL_CLOCK_CPU_PRESERVE                 (1 << 28)
#define SYSCTL_CLOCK_CPU_SUB1_DIV_SHIFT           (20)
#define SYSCTL_CLOCK_CPU_SUB1_DIV_MASK            (0xfU << SYSCTL_CLOCK_CPU_SUB1_DIV_SHIFT)
#define SYSCTL_CLOCK_CPU_SUB1_DIV(n)              ((n) << SYSCTL_CLOCK_CPU_SUB1_DIV_SHIFT)
#define SYSCTL_CLOCK_CPU_SUB0_DIV_SHIFT           (16)
#define SYSCTL_CLOCK_CPU_SUB0_DIV_MASK            (0xfU << SYSCTL_CLOCK_CPU_SUB0_DIV_SHIFT)
#define SYSCTL_CLOCK_CPU_SUB0_DIV(n)              ((n) << SYSCTL_CLOCK_CPU_SUB0_DIV_SHIFT)
#define SYSCTL_CLOCK_CPU_MUX_SHIFT                (8)
#define SYSCTL_CLOCK_CPU_MUX_MASK                 (0xfU << SYSCTL_CLOCK_CPU_MUX_SHIFT)
#  define SYSCTL_CLOCK_CPU_MUX_OSC0_CLK0          (0 << SYSCTL_CLOCK_CPU_MUX_SHIFT)
#  define SYSCTL_CLOCK_CPU_MUX_PLL0_CLK0          (1 << SYSCTL_CLOCK_CPU_MUX_SHIFT)
#  define SYSCTL_CLOCK_CPU_MUX_PLL0_CLK1          (2 << SYSCTL_CLOCK_CPU_MUX_SHIFT)
#  define SYSCTL_CLOCK_CPU_MUX_PLL0_CLK2          (3 << SYSCTL_CLOCK_CPU_MUX_SHIFT)
#  define SYSCTL_CLOCK_CPU_MUX_PLL1_CLK0          (4 << SYSCTL_CLOCK_CPU_MUX_SHIFT)
#  define SYSCTL_CLOCK_CPU_MUX_PLL1_CLK1          (5 << SYSCTL_CLOCK_CPU_MUX_SHIFT)
#  define SYSCTL_CLOCK_CPU_MUX_PLL2_CLK0          (6 << SYSCTL_CLOCK_CPU_MUX_SHIFT)
#  define SYSCTL_CLOCK_CPU_MUX_PLL2_CLK1          (7 << SYSCTL_CLOCK_CPU_MUX_SHIFT)
#define SYSCTL_CLOCK_CPU_DIV_SHIFT                (0)
#define SYSCTL_CLOCK_CPU_DIV_MASK                 (0xffU << SYSCTL_CLOCK_CPU_DIV_SHIFT)
#define SYSCTL_CLOCK_CPU_DIV(n)                   ((n) << SYSCTL_CLOCK_CPU_DIV_SHIFT)

#define SYSCTL_CLOCK_GLB_BUSY                     (1 << 31)
#define SYSCTL_CLOCK_LOC_BUSY                     (1 << 30)
#define SYSCTL_CLOCK_PRESERVE                     (1 << 28)
#define SYSCTL_CLOCK_SUB1_DIV_SHIFT               (20)
#define SYSCTL_CLOCK_SUB1_DIV_MASK                (0xfU << SYSCTL_CLOCK_SUB1_DIV_SHIFT)
#define SYSCTL_CLOCK_SUB1_DIV(n)                  ((n) << SYSCTL_CLOCK_SUB1_DIV_SHIFT)
#define SYSCTL_CLOCK_SUB0_DIV_SHIFT               (16)
#define SYSCTL_CLOCK_SUB0_DIV_MASK                (0xfU << SYSCTL_CLOCK_SUB0_DIV_SHIFT)
#define SYSCTL_CLOCK_SUB0_DIV(n)                  ((n) << SYSCTL_CLOCK_SUB0_DIV_SHIFT)
#define SYSCTL_CLOCK_MUX_SHIFT                    (8)
#define SYSCTL_CLOCK_MUX_MASK                     (0xfU << SYSCTL_CLOCK_MUX_SHIFT)
#  define SYSCTL_CLOCK_MUX_OSC0_CLK0              (0 << SYSCTL_CLOCK_MUX_SHIFT)
#  define SYSCTL_CLOCK_MUX_PLL0_CLK0              (1 << SYSCTL_CLOCK_MUX_SHIFT)
#  define SYSCTL_CLOCK_MUX_PLL0_CLK1              (2 << SYSCTL_CLOCK_MUX_SHIFT)
#  define SYSCTL_CLOCK_MUX_PLL0_CLK2              (3 << SYSCTL_CLOCK_MUX_SHIFT)
#  define SYSCTL_CLOCK_MUX_PLL1_CLK0              (4 << SYSCTL_CLOCK_MUX_SHIFT)
#  define SYSCTL_CLOCK_MUX_PLL1_CLK1              (5 << SYSCTL_CLOCK_MUX_SHIFT)
#  define SYSCTL_CLOCK_MUX_PLL2_CLK0              (6 << SYSCTL_CLOCK_MUX_SHIFT)
#  define SYSCTL_CLOCK_MUX_PLL2_CLK1              (7 << SYSCTL_CLOCK_MUX_SHIFT)
#define SYSCTL_CLOCK_DIV_SHIFT                    (0)
#define SYSCTL_CLOCK_DIV_MASK                     (0xffU << SYSCTL_CLOCK_DIV_SHIFT)
#define SYSCTL_CLOCK_DIV(n)                       ((n-1) << SYSCTL_CLOCK_DIV_SHIFT)

#define SYSCTL_ADCCLK_GLB_BUSY                    (1 << 31)
#define SYSCTL_ADCCLK_LOC_BUSY                    (1 << 30)
#define SYSCTL_ADCCLK_PRESERVE                    (1 << 28)
#define SYSCTL_ADCCLK_MUX_ANA_CLOCK               (0)
#define SYSCTL_ADCCLK_MUX_AHB_CLOCK               (1 << 8)

#define SYSCTL_DACCLK_GLB_BUSY                    (1 << 31)
#define SYSCTL_DACCLK_LOC_BUSY                    (1 << 30)
#define SYSCTL_DACCLK_PRESERVE                    (1 << 28)
#define SYSCTL_DACCLK_MUX_ANA_CLOCK               (0)
#define SYSCTL_DACCLK_MUX_AHB_CLOCK               (1 << 8)

#define SYSCTL_DACCLK_GLB_BUSY                    (1 << 31)
#define SYSCTL_DACCLK_LOC_BUSY                    (1 << 30)
#define SYSCTL_DACCLK_PRESERVE                    (1 << 28)
#define SYSCTL_DACCLK_MUX_AUD_CLOCK0              (0)
#define SYSCTL_DACCLK_MUX_AUD_CLOCK1              (1 << 8)

#define SYSCTL_GLOBAL00_MUX_SHIFT                 (0)
#define SYSCTL_GLOBAL00_MUX_MASK                  (3 << SYSCTL_GLOBAL00_MUX_SHIFT)
#define SYSCTL_GLOBAL00_MUX(n)                    ((n) << SYSCTL_GLOBAL00_MUX_SHIFT)
#define   SYSCTL_GLOBAL00_MUX_24M                 (0)
#define   SYSCTL_GLOBAL00_MUX_SUG                 (1 << 1)

#define SYSCTL_MONITOR_CONTROL_VALID              (1 << 31)
#define SYSCTL_MONITOR_CONTROL_DIV_BUSY           (1 << 27)
#define SYSCTL_MONITOR_CONTROL_OUTEN              (1 << 24)
#define SYSCTL_MONITOR_CONTROL_DIV_SHIFT          (16)
#define SYSCTL_MONITOR_CONTROL_DIV_MASK           (0xffU << SYSCTL_MONITOR_CONTROL_DIV_SHIFT)
#define SYSCTL_MONITOR_CONTROL_DIV(n)             ((n) << SYSCTL_MONITOR_CONTROL_DIV_SHIFT)
#define SYSCTL_MONITOR_CONTROL_HIGH               (1 << 15)
#define SYSCTL_MONITOR_CONTROL_LOW                (1 << 14)
#define SYSCTL_MONITOR_CONTROL_START              (1 << 12)
#define SYSCTL_MONITOR_CONTROL_MODE               (1 << 10)
#define SYSCTL_MONITOR_CONTROL_ACCURACY           (1 << 9)
#define SYSCTL_MONITOR_CONTROL_REFERENCE          (1 << 8)
#define SYSCTL_MONITOR_CONTROL_SELECTION_SHIFT    (0)
#define SYSCTL_MONITOR_CONTROL_SELECTION_MASK     (0xffU << SYSCTL_MONITOR_CONTROL_SELECTION_SHIFT)
#define SYSCTL_MONITOR_CONTROL_SELECTION(n)       ((n) << SYSCTL_MONITOR_CONTROL_SELECTION_SHIFT)

#define SYSCTL_CPU_LP_WAKE_CNT_SHIFT              (24)
#define SYSCTL_CPU_LP_WAKE_CNT_MASK               (0xffU << SYSCTL_CPU_LP_WAKE_CNT_SHIFT)
#define SYSCTL_CPU_LP_WAKE_CNT_CLEAR              (0)
#define SYSCTL_CPU_LP_HALT                        (1 << 16)
#define SYSCTL_CPU_LP_WAKE                        (1 << 13)
#define SYSCTL_CPU_LP_EXEC                        (1 << 12)
#define SYSCTL_CPU_LP_WAKE_FLAG                   (1 << 10)
#define SYSCTL_CPU_LP_SLEEP_FLAG                  (1 << 9)
#define SYSCTL_CPU_LP_RESET_FLAG                  (1 << 8)
#define SYSCTL_CPU_LP_MODE_SHIFT                  (0)
#define SYSCTL_CPU_LP_MODE_MASK                   (0x3 << SYSCTL_CPU_LP_MODE_SHIFT)
#define SYSCTL_CPU_LP_MODE_WAIT                   (0 << SYSCTL_CPU_LP_MODE_SHIFT)
#define SYSCTL_CPU_LP_MODE_HALT                   (1 << SYSCTL_CPU_LP_MODE_SHIFT)
#define SYSCTL_CPU_LP_MODE_RUN                    (2 << SYSCTL_CPU_LP_MODE_SHIFT)

#define SYSCTL_CPU_LOCK_GPR_SHIFT                 (2)
#define SYSCTL_CPU_LOCK_GPR_MASK                  (0x3f << SYSCTL_CPU_LOCK_GPR_SHIFT)
#define SYSCTL_CPU_LOCK_LOCK                      (1 << 1)

