apache/nuttx/arch/risc-v/src/hpm6000/hardware/hpm6300/hpm6300_sysctl.h
#define SYSCTL_CPU_GPR_GPR_MASK                   (0xffff)

#define SYSCTL_CPU_WAKEUP_STATUS_MASK             (0xffff)

#define SYSCTL_CPU_WAKEUP_ENABLE_MASK             (0xffff)

#define SYSCTL_GROUP0_LINK0_AHBP                      (1 << 0)
#define SYSCTL_GROUP0_LINK0_AXIS                      (1 << 1)
#define SYSCTL_GROUP0_LINK0_AXIC                      (1 << 2)
#define SYSCTL_GROUP0_LINK0_FEMC                      (1 << 3)
#define SYSCTL_GROUP0_LINK0_ROM0                      (1 << 4)
#define SYSCTL_GROUP0_LINK0_LMM0                      (1 << 5)
#define SYSCTL_GROUP0_LINK0_RAM0                      (1 << 6)
#define SYSCTL_GROUP0_LINK0_MCHTMR0                   (1 << 7)
#define SYSCTL_GROUP0_LINK0_XPI0                      (1 << 8)
#define SYSCTL_GROUP0_LINK0_XPI1                      (1 << 9)
#define SYSCTL_GROUP0_LINK0_SDP0                      (1 << 10)
#define SYSCTL_GROUP0_LINK0_RNG0                      (1 << 11)
#define SYSCTL_GROUP0_LINK0_KMAN                      (1 << 12)
#define SYSCTL_GROUP0_LINK0_DMA0                      (1 << 13)
#define SYSCTL_GROUP0_LINK0_DMA1                      (1 << 14)
#define SYSCTL_GROUP0_LINK0_FFA0                      (1 << 15)
#define SYSCTL_GROUP0_LINK0_GPIO                      (1 << 16)
#define SYSCTL_GROUP0_LINK0_MBX0                      (1 << 17)
#define SYSCTL_GROUP0_LINK0_WDG0                      (1 << 18)
#define SYSCTL_GROUP0_LINK0_WDG1                      (1 << 19)
#define SYSCTL_GROUP0_LINK0_TSNS                      (1 << 20)
#define SYSCTL_GROUP0_LINK0_GPTMR0                    (1 << 21)
#define SYSCTL_GROUP0_LINK0_GPTMR1                    (1 << 22)
#define SYSCTL_GROUP0_LINK0_GPRMR2                    (1 << 23)
#define SYSCTL_GROUP0_LINK0_GPTMR3                    (1 << 24)
#define SYSCTL_GROUP0_LINK0_UART0                     (1 << 25)
#define SYSCTL_GROUP0_LINK0_UART1                     (1 << 26)
#define SYSCTL_GROUP0_LINK0_UART2                     (1 << 27)
#define SYSCTL_GROUP0_LINK0_UART3                     (1 << 28)
#define SYSCTL_GROUP0_LINK0_UART4                     (1 << 29)
#define SYSCTL_GROUP0_LINK0_UART5                     (1 << 30)
#define SYSCTL_GROUP0_LINK0_UART6                     (1 << 11)
#define SYSCTL_GROUP0_LINK1_UART7                     (1 << 0)
#define SYSCTL_GROUP0_LINK1_I2C0                      (1 << 1)
#define SYSCTL_GROUP0_LINK1_I2C1                      (1 << 2)
#define SYSCTL_GROUP0_LINK1_I2C2                      (1 << 3)
#define SYSCTL_GROUP0_LINK1_I2C3                      (1 << 4)
#define SYSCTL_GROUP0_LINK1_SPI0                      (1 << 5)
#define SYSCTL_GROUP0_LINK1_SPI1                      (1 << 6)
#define SYSCTL_GROUP0_LINK1_SPI2                      (1 << 7)
#define SYSCTL_GROUP0_LINK1_SPI3                      (1 << 8)
#define SYSCTL_GROUP0_LINK1_CAN0                      (1 << 9)
#define SYSCTL_GROUP0_LINK1_CAN1                      (1 << 10)
#define SYSCTL_GROUP0_LINK1_PTPC                      (1 << 11)
#define SYSCTL_GROUP0_LINK1_ADC0                      (1 << 12)
#define SYSCTL_GROUP0_LINK1_ADC1                      (1 << 13)
#define SYSCTL_GROUP0_LINK1_ADC2                      (1 << 14)
#define SYSCTL_GROUP0_LINK1_DAC0                      (1 << 15)
#define SYSCTL_GROUP0_LINK1_ACMP                      (1 << 16)
#define SYSCTL_GROUP0_LINK1_I2S0                      (1 << 17)
#define SYSCTL_GROUP0_LINK1_I2S1                      (1 << 18)
#define SYSCTL_GROUP0_LINK1_I2SPDM0                   (1 << 19)
#define SYSCTL_GROUP0_LINK1_I2SDAO                    (1 << 20)
#define SYSCTL_GROUP0_LINK1_MSYN                      (1 << 21)
#define SYSCTL_GROUP0_LINK1_MOT0                      (1 << 22)
#define SYSCTL_GROUP0_LINK1_MOT1                      (1 << 23)
#define SYSCTL_GROUP0_LINK1_ETH0                      (1 << 24)
#define SYSCTL_GROUP0_LINK1_NTMR0                     (1 << 25)
#define SYSCTL_GROUP0_LINK1_SDXC0                     (1 << 26)
#define SYSCTL_GROUP0_LINK1_USB0                      (1 << 27)
#define SYSCTL_GROUP0_LINK1_REF0                      (1 << 28)
#define SYSCTL_GROUP0_LINK1_REF1                      (1 << 29)

#define SYSCTL_RESOURCE_CPU0                      (0)
#define SYSCTL_RESOURCE_CPX1                      (1)
#define SYSCTL_RESOURCE_EXE0                      (2)
#define SYSCTL_RESOURCE_WAK0                      (3)
#define SYSCTL_RESOURCE_CPU0_PER                  (4)
#define SYSCTL_RESOURCE_LOGIC0                    (16)
#define SYSCTL_RESOURCE_LOGIC1                    (17)
#define SYSCTL_RESOURCE_LOGIC2                    (18)
#define SYSCTL_RESOURCE_LOGIC3                    (19)
#define SYSCTL_RESOURCE_PMIC                      (20)
#define SYSCTL_RESOURCE_POW_CPU0                  (21)
#define SYSCTL_RESOURCE_RST_SOC                   (22)
#define SYSCTL_RESOURCE_RST_CPU0                  (23)
#define SYSCTL_RESOURCE_XTAL                      (32)
#define SYSCTL_RESOURCE_PLL0                      (33)
#define SYSCTL_RESOURCE_CLK0_PLL0                 (34)
#define SYSCTL_RESOURCE_CLK1_PLL0                 (35)
#define SYSCTL_RESOURCE_CLK2_PLL0                 (36)
#define SYSCTL_RESOURCE_PLL1                      (37)
#define SYSCTL_RESOURCE_CLK0_PLL1                 (38)
#define SYSCTL_RESOURCE_CLK1_PLL1                 (39)
#define SYSCTL_RESOURCE_PLL2                      (40)
#define SYSCTL_RESOURCE_CLK0_PLL2                 (41)
#define SYSCTL_RESOURCE_CLK1_PLL2                 (42)
#define SYSCTL_RESOURCE_PLL0_REF                  (43)
#define SYSCTL_RESOURCE_PLL1_REF                  (44)
#define SYSCTL_RESOURCE_PLL2_REF                  (45)
#define SYSCTL_RESOURCE_MBIST_SOC                 (48)
#define SYSCTL_RESOURCE_MBIST_CPU                 (49)
#define SSYCTL_RESOURCE_MBIST_CON                 (50)
#define SYSCTL_RESOURCE_DFT_START_BUS             (51)
#define SYSCTL_RESOURCE_CLK_TOP_CPU0              (64)
#define SYSCTL_RESOURCE_CLK_TOP_MCHTMR0           (65)
#define SYSCTL_RESOURCE_CLK_TOP_FEMC              (66)
#define SYSCTL_RESOURCE_CLK_TOP_XPI0              (67)
#define SYSCTL_RESOURCE_CLK_TOP_XPI1              (68)
#define SYSCTL_RESOURCE_CLK_TOP_ANA1              (93)
#define SYSCTL_RESOURCE_CLK_TOP_ANA2              (94)
#define SYSCTL_RESOURCE_CLK_TOP_ANA3              (95)
#define SYSCTL_RESOURCE_CLK_TOP_AUD0              (96)
#define SYSCTL_RESOURCE_CLK_TOP_AUD1              (97)
#define SYSCTL_RESOURCE_CLK_TOP_ETH0              (98)
#define SYSCTL_RESOURCE_CLK_TOP_PTP0              (99)
#define SYSCTL_RESOURCE_CLK_TOP_REF0              (100)
#define SYSCTL_RESOURCE_CLK_TOP_REF1              (101)
#define SYSCTL_RESOURCE_CLK_TOP_NTMR0             (102)
#define SYSCTL_RESOURCE_CLK_TOP_SDXC0             (103)
#define SYSCTL_RESOURCE_CLK_TOP_ADC0              (128)
#define SYSCTL_RESOURCE_CLK_TOP_ADC1              (129)
#define SYSCTL_RESOURCE_CLK_TOP_ADC2              (130)
#define SYSCTL_RESOURCE_CLK_TOP_DAC0              (131)
#define SYSCTL_RESOURCE_CLK_TOP_I2S0              (132)
#define SYSCTL_RESOURCE_CLK_TOP_I2S1              (133)

#define SYSCTL_RESOURCE_ETH0_MEM                  (192)
#define SYSCTL_RESOURCE_SDXC0_MEM                 (193)
#define SYSCTL_RESOURCE_USB0_MEM                  (194)
#define SYSCTL_RESOURCE_RAM0_MEM                  (195)
#define SYSCTL_RESOURCE_AHBP_MEM                  (196)
#define SYSCTL_RESOURCE_FEMC_MEM                  (197)
#define SYSCTL_RESOURCE_ROM0_MEM                  (198)
#define SYSCTL_RESOURCE_XPI0_MEM                  (199)
#define SYSCTL_RESOURCE_XPI1_MEM                  (200)
#define SYSCTL_RESOURCE_CAN0_MEM                  (201)
#define SYSCTL_RESOURCE_CAN1_MEM                  (202)
#define SYSCTL_RESOURCE_I2S0_MEM                  (203)
#define SYSCTL_RESOURCE_I2S1_MEM                  (204)
#define SYSCTL_RESOURCE_PDM0_MEM                  (205)
#define SYSCTL_RESOURCE_SDP0_MEM                  (206)
#define SYSCTL_RESOURCE_FFA0_MEM                  (207)
#define SYSCTL_RESOURCE_CPX_MEM                   (208)
#define SYSCTL_RESOURCE_CORE_MEM                  (209)
#define SYSCTL_RESOURCE_LMM0_MEM                  (210)

#define SYSCTL_RESOURCE_LINKABLE_START            (256)
#define SYSCTL_RESOURCE_AHBP                      (256)
#define SYSCTL_RESOURCE_AXIS                      (257)
#define SYSCTL_RESOURCE_AXIC                      (258)
#define SYSCTL_RESOURCE_FEMC                      (259)
#define SYSCTL_RESOURCE_ROM0                      (260)
#define SYSCTL_RESOURCE_LMM0                      (261)
#define SYSCTL_RESOURCE_RAM0                      (262)
#define SYSCTL_RESOURCE_MCHTMR0                   (263)
#define SYSCTL_RESOURCE_XPI0                      (264)
#define SYSCTL_RESOURCE_XPI1                      (265)
#define SYSCTL_RESOURCE_SDP0                      (266)
#define SYSCTL_RESOURCE_RNG0                      (267)
#define SYSCTL_RESOURCE_KMAN                      (268)
#define SYSCTL_RESOURCE_DMA0                      (269)
#define SYSCTL_RESOURCE_DMA1                      (270)
#define SYSCTL_RESOURCE_FFA0                      (271)
#define SYSCTL_RESOURCE_GPIO                      (272)
#define SYSCTL_RESOURCE_MBX0                      (273)
#define SYSCTL_RESOURCE_WDG0                      (274)
#define SYSCTL_RESOURCE_WDG1                      (275)
#define SYSCTL_RESOURCE_TSNS                      (276)
#define SYSCTL_RESOURCE_GPTMR0                    (277)
#define SYSCTL_RESOURCE_GPTMR1                    (278)
#define SYSCTL_RESOURCE_GPRMR2                    (279)
#define SYSCTL_RESOURCE_GPTMR3                    (280)
#define SYSCTL_RESOURCE_UART0                     (281)
#define SYSCTL_RESOURCE_UART1                     (282)
#define SYSCTL_RESOURCE_UART2                     (283)
#define SYSCTL_RESOURCE_UART3                     (284)
#define SYSCTL_RESOURCE_UART4                     (285)
#define SYSCTL_RESOURCE_UART5                     (286)
#define SYSCTL_RESOURCE_UART6                     (287)
#define SYSCTL_RESOURCE_UART7                     (288)
#define SYSCTL_RESOURCE_I2C0                      (289)
#define SYSCTL_RESOURCE_I2C1                      (290)
#define SYSCTL_RESOURCE_I2C2                      (291)
#define SYSCTL_RESOURCE_I2C3                      (292)
#define SYSCTL_RESOURCE_SPI0                      (293)
#define SYSCTL_RESOURCE_SPI1                      (294)
#define SYSCTL_RESOURCE_SPI2                      (295)
#define SYSCTL_RESOURCE_SPI3                      (296)
#define SYSCTL_RESOURCE_CAN0                      (297)
#define SYSCTL_RESOURCE_CAN1                      (298)
#define SYSCTL_RESOURCE_PTPC                      (299)
#define SYSCTL_RESOURCE_ADC0                      (300)
#define SYSCTL_RESOURCE_ADC1                      (301)
#define SYSCTL_RESOURCE_ADC2                      (302)
#define SYSCTL_RESOURCE_DAC0                      (303)
#define SYSCTL_RESOURCE_ACMP                      (304)
#define SYSCTL_RESOURCE_I2S0                      (305)
#define SYSCTL_RESOURCE_I2S1                      (306)
#define SYSCTL_RESOURCE_I2SPDM0                   (307)
#define SYSCTL_RESOURCE_I2SDAO                    (308)
#define SYSCTL_RESOURCE_MSYN                      (309)
#define SYSCTL_RESOURCE_MOT0                      (310)
#define SYSCTL_RESOURCE_MOT1                      (311)
#define SYSCTL_RESOURCE_ETH0                      (312)
#define SYSCTL_RESOURCE_NTMR0                     (313)
#define SYSCTL_RESOURCE_SDXC0                     (314)
#define SYSCTL_RESOURCE_USB0                      (315)
#define SYSCTL_RESOURCE_REF0                      (316)
#define SYSCTL_RESOURCE_REF1                      (317)
#define SYSCTL_RESOURCE_LINKABLE_END              (317)

#define CLOCK_NODE_MCHTMR0                        (0)
#define CLOCK_NODE_FEMC                           (1)
#define CLOCK_NODE_XPI0                           (2)
#define CLOCK_NODE_XPI1                           (3)
#define CLOCK_NODE_GPTMR0                         (4)
#define CLOCK_NODE_GPTMR1                         (5)
#define CLOCK_NODE_GPTMR2                         (6)
#define CLOCK_NODE_GPTMR3                         (7)
#define CLOCK_NODE_UART0                          (8)
#define CLOCK_NODE_UART1                          (9)
#define CLOCK_NODE_UART2                          (10)
#define CLOCK_NODE_UART3                          (11)
#define CLOCK_NODE_UART4                          (12)
#define CLOCK_NODE_UART5                          (13)
#define CLOCK_NODE_UART6                          (14)
#define CLOCK_NODE_UART7                          (15)
#define CLOCK_NODE_I2C0                           (16)
#define CLOCK_NODE_I2C1                           (17)
#define CLOCK_NODE_I2C2                           (18)
#define CLOCK_NODE_I2C3                           (19)
#define CLOCK_NODE_SPI0                           (20)
#define CLOCK_NODE_SPI1                           (21)
#define CLOCK_NODE_SPI2                           (22)
#define CLOCK_NODE_SPI3                           (23)
#define CLOCK_NODE_CAN0                           (24)
#define CLOCK_NODE_CAN1                           (25)
#define CLOCK_NODE_PTPC                           (26)
#define CLOCK_NODE_ANA0                           (27)
#define CLOCK_NODE_ANA1                           (28)
#define CLOCK_NODE_ANA2                           (29)
#define CLOCK_NODE_ANA3                           (30)
#define CLOCK_NODE_AUD0                           (31)
#define CLOCK_NODE_AUD1                           (32)
#define CLOCK_NODE_ETH0                           (33)
#define CLOCK_NODE_PTP0                           (34)
#define CLOCK_NODE_REF0                           (35)
#define CLOCK_NODE_REF1                           (36)
#define CLOCK_NODE_NTMR0                          (37)
#define CLOCK_NODE_SDXC0                          (38)

#define CLOCK_NODE_ADC0                           (0)
#define CLOCK_NODE_ADC1                           (1)
#define CLOCK_NODE_ADC2                           (2)

#define CLOCK_NODE_DAC0                           (1)

#define CLOCK_NODE_I2S0                           (0)
#define CLOCK_NODE_I2S1                           (1)

#define CLOCK_NODE_CORE_START                     (252)
#define CLOCK_NODE_CPU0                           (252)
#define CLOCK_NODE_AXI                            (253)
#define CLOCK_NODE_AHB                            (254)

#endif /* __ARCH_RISCV_SRC_HPM6000_HARDWARE_HPM6300_HPM6300_SYSCTL_H */
